<?php
$name = "Vitali";
$surname = "Mayerau";

$depart = [
    'ФАИС' => [
        'кафедра 1' => 'Информационные технологии',
        'кафедра 2' => 'Промышленная электроника',
        'кафедра 3' => 'Автоматизированные системы управления',
        'кафедра 4' => 'Высшая математика',
        'кафедра 5' => 'Информатика'
    ],
    'ЭФ' => [
        'кафедра 1' => 'Электроснабжение',
        'кафедра 2' => 'Промышленная теплоэнергетика',
        'кафедра 3' => 'Иностранные языки',
        'кафедра 4' => 'Теоретические основы электротехники',
        'кафедра 5' => 'Физика'
    ],
    'МСФ' => [
        'кафедра 1' => 'Технология машиностроения',
        'кафедра 2' => 'Металлорежущие станки',
        'кафедра 3' => 'Разработка и эксплуатация нефтяных'
    ]
];


ksort($depart); 
foreach ($depart as &$faculties) {
    ksort($faculties); 
}

foreach ($depart as $faculty => $departments) {
    echo $faculty . "\n";
    echo "<ul>"; 
    foreach ($departments as $key => $name) {
        echo "<li>" . $key . " " . $name . "</li>"; 
    }
    echo "</ul>"; 

}
print_r("Разработчик скрипта: <?=$name; ?><br><?=$surname; ?>");
?>
